app/controllers/v1/messages_controller.rb

SELECT "messages".* FROM "messages"
---
  def index
    render json: { messages: Message.all }

INSERT INTO "messages" ("slack_team_name", "slack_channel_name", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    message = Message.new(message_params)
    if message.save

SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 104], ["LIMIT", 1]]
UPDATE "messages" SET "slack_team_name" = $1, "slack_channel_name" = $2, "updated_at" = $3 WHERE "messages"."id" = $4  [["slack_team_name", "launch-jupiter-2"], ["slack_channel_name", "general-2"], ["updated_at", 2017-02-09 00:43:40 UTC], ["id", 104]]
---
  def update
    message = Message.find(params[:id])
    if message.update(message_params)

DELETE FROM "messages" WHERE "messages"."id" = $1  [["id", 8]]
SELECT  "messages".* FROM "messages" WHERE "messages"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def destroy
    message = Message.find(params[:id]).destroy